Revit 2024 API
AreaBasedLoadData Class
 Represents the electrical area based load data.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public class AreaBasedLoadData : ZoneElementDomainData
Visual Basic
Public Class AreaBasedLoadData _
	Inherits ZoneElementDomainData
Visual C++
public ref class AreaBasedLoadData : public ZoneElementDomainData
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Mechanical.ZoneElementDomainData
 Autodesk.Revit.DB.Electrical.AreaBasedLoadData
See Also
AreaBasedLoadData Members
Autodesk.Revit.DB.Electrical Namespace